#  ========================================
# |  _                        __ _ _       |
# | | |__  _ __ _____      __/ _(_) | ___  |
# | | '_ \| '__/ _ \ \ /\ / / |_| | |/ _ \ |
# | | |_) | | |  __/\ V  V /|  _| | |  __/ |
# | |_.__/|_|  \___| \_/\_/ |_| |_|_|\___| |
#  ========================================

tap 'github/gh'

tap 'mongodb/brew'

tap 'twilio/brew'
brew 'twilio'

# Ookla Speedtest
tap 'teamookla/speedtest'
brew 'speedtest'

# Espanso
tap 'federico-terzi/espanso'
brew 'espanso'

# tap 'jmespath/jmespath'
# brew 'jmespath/jmespath/jp'

# https://github.com/microsoft/git-credential-manager-core
tap 'microsoft/git'
cask 'microsoft/git/git-credential-manager-core'
brew 'azure-cli' # Microsoft
# tap 'stripe/stripe-cli'
# brew 'stripe'
tap 'powershell/tap'
brew 'powershell'
brew 'riscv'
brew 'twilio'

# https://dart.dev/get-dart
tap 'dart-lang/dart'
brew 'dart'

# A man-db installation without the 'g' prefix
tap 'alhadis/troff'
brew 'alhadis/troff/man-db'
# --------------------

cask 'flutter'

# GNU Programs
# ============
# brew 'gdb'
# brew 'gcc'
brew 'bash'
brew 'grep'
brew 'gzip'
brew 'make'
brew 'less'
brew 'gawk'
brew 'emacs'
brew 'groff'
brew 'gnupg'
# brew 'man-db'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'datamash'
brew 'binutils'
# brew 'iputils' // requires Linux
brew 'inetutils'
brew 'findutils'
brew 'coreutils'
brew 'diffutils'
brew 'gnu-which'
brew 'gnu-getopt'
# ===========

# Useful Programs
# ===============
brew 'jq'
brew 'yq'
brew 'git'
brew 'zip'
brew 'fzf'
# brew 'vim'
# brew 'tbb'
brew 'duti'
brew 'wget'
# brew 'john'
brew 'tldr'
brew 'nmap'
brew 'curl'
# brew 'llvm'
brew 'lsof'
brew 'node'
brew 'yarn'
brew 'webp'
# brew 'mutt'
# brew 'perl'
# brew 'ruby'
brew 'tree'
brew 'tmux'
# brew 'p7zip'
brew 'cmake'
brew 'unzip'
brew 'watch'
brew 'screen'
# brew 'pacvim'
# brew 'hashcat'
brew 'newman' # Postman CLI
brew 'neovim'
brew 'figlet'
brew 'ffmpeg'
# brew 'telnet'
# brew 'tcpdump'
brew 'python'
brew 'sphinx-doc'
brew 'neomutt'
brew 'openssl'
brew 'openssh'
brew 'translate-shell'
# brew 'transmission-cli'
# https://github.com/postmanlabs/newman#readme
brew 'asciinema'
brew 'newman'
# ====================
# Useful Applications
# ===================
cask 'vlc'
cask 'java'
cask 'authy'
cask 'twitch'
cask 'docker'
cask 'discord'
cask 'firefox'
cask 'postman'
# cask 'wireshark'
cask 'tor-browser'
cask 'google-chrome'
# -------------------

# ================
# Random Tools
# ================

# journal CLI
brew 'jrnl'

# mail CLI
brew 'himalaya'

# image/video manipulation
brew 'webp'
brew 'libavif'
brew 'librsvg'
brew 'imagemagick'
brew 'ffmpeg'

# Packages from beloved Rustaceans
brew 'rust'
brew 'ripgrep'
brew 'exa'
brew 'fd'
brew 'bat'
brew 'himalaya'
brew 'the_silver_searcher'
# ----------------

# cask 'basictex'
# cask 'texshop'
# ==================
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
# ==================

# Use my tap!
# Warning: My tap is not maintained very rigorously.
#          submit an issue if you notice a problem.
# tap 'austintraver/tap'
